Repository: nmoschkin/wslipconf
Catalog: wslipconf/wslipconf/Localization/AppResources.*.resx
Languages: fr_fr, it_it

source: Add Rule
fr_fr: Ajouter une règle
it_it: Aggiungi regola

source: Apply Rules
fr_fr: Appliquer les règles
it_it: Applica regole

# AutoApply
source: Auto Apply Changes
fr_fr: Appliquer automatiquement les modifications
it_it: Applicare automaticamente le modifiche

# AutoDest
source: Automatic WSL Destination
fr_fr: Destination WSL automatique
it_it: Destinazione WSL automatica

# AutoIPX
source: Auto IP: {0}
fr_fr: IP automatique : {0}
it_it: IP automatico: {0}

source: Cancel
fr_fr: Annuler
it_it: Annulla

source: Clear
fr_fr: clair
it_it: chiaro

source: Clear Rules
fr_fr: Des règles claires
it_it: Regole chiare

# ConfirmClearRules
source: Are you sure you want to clear all rules?
fr_fr: Êtes-vous sûr de vouloir effacer toutes les règles?
it_it: Cancellare tutte le regole?

# ConfirmReloadRules
source: Are you sure you want to reload the rules? Unsaved changes will be discarded.
fr_fr: Voulez-vous vraiment recharger les règles ? Les modifications non enregistrées seront ignorées.
it_it: Ricaricare le regole? Le modifiche non salvate verranno eliminate.

# ConfirmRemoveRules
source: Are you sure you want to remove the selected rules?
fr_fr: Voulez-vous vraiment supprimer les règles sélectionnées ?
it_it: Rimuovere le regole selezionate?

source: Copy IP Address
fr_fr: Copier l’adresse IP
it_it: Copia indirizzo IP

# DeleteRule
source: Delete Selected Rules
fr_fr: Supprimer les règles sélectionnées
it_it: Elimina regole selezionate

source: Destination Address
fr_fr: Adresse de destination
it_it: Indirizzo di destinazione

source: Destination Port
it_it: Porta di destinazione

source: Edit Rule
fr_fr: Modifier la règle
it_it: Modifica regola

source: Edit Rules
fr_fr: Modifier les règles
it_it: Modifica regole

source: Error
fr_fr: erreur
it_it: errore

# ErrorApplying
source: Error applying rules!
fr_fr: Erreur lors de l’application des règles !
it_it: Errore durante l'applicazione delle regole.

# ErrorCannotSave
source: There are errors on the page and the item cannot be saved!
fr_fr: Il y a des erreurs sur la page et l’élément ne peut pas être enregistré!
it_it: Ci sono errori nella pagina e l'elemento non può essere salvato!

# ErrorFieldBlank
source: This field cannot be blank.
fr_fr: Ce champ ne peut pas être vide.
it_it: Questo campo non può essere vuoto.

# ErrorInvalidFormat
source: This value for this field is in an incorrect format.
fr_fr: Cette valeur pour ce champ est dans un format incorrect.
it_it: Questo valore per questo campo è in un formato errato.

# ErrorInvalidValue
source: The value for this field is invalid.
fr_fr: La valeur de ce champ n’est pas valide.
it_it: Il valore di questo campo non è valido.

source: Get Current Rules
fr_fr: Obtenir les règles actuelles
it_it: Ottenere le regole correnti

# IconTip
source: Current WSL IP Address: {1}
fr_fr: Adresse IP WSL actuelle : {1}
it_it: Indirizzo IP WSL corrente: {1}

source: IP Address Copied!
fr_fr: Adresse IP copiée!
it_it: Indirizzo IP copiato!

# MainTitle
source: WSL Port Binding Tool
fr_fr: Outil de liaison de port WSL
it_it: Strumento di associazione porta WSL

source: Name
fr_fr: nom
it_it: nome

source: New Rule Definition
fr_fr: Nouvelle définition de règle
it_it: Nuova definizione di regola

source: Quit
fr_fr: démissionner
it_it: dimettersi

source: Refresh and Apply
fr_fr: Actualiser et appliquer
it_it: Aggiornare e applicare

source: Refresh IP
fr_fr: Actualiser l’adresse IP
it_it: Aggiorna IP

# RefreshWSLIP
source: Refresh WSL IP Address
fr_fr: Actualiser l’adresse IP WSL
it_it: Aggiornare l'indirizzo IP WSL

source: Reload
fr_fr: recharger
it_it: ricaricare

# Rerun
source: Re-Apply Rules
fr_fr: Réapprition des règles
it_it: Riapplicazione delle regole

source: Reset
fr_fr: réinitialisation
it_it: resettare

# RulesApplied
source: Rules applied successfully!
fr_fr: Les règles appliquées avec succès!
it_it: Regole applicate correttamente!

source: Run On Startup
fr_fr: Exécuter au démarrage
it_it: Esegui all'avvio

source: Save
fr_fr: sauvegarder
it_it: salvare

source: Show Window
fr_fr: Afficher la fenêtre
it_it: Mostra finestra

source: Source Address
fr_fr: Adresse source
it_it: Indirizzo di origine

source: Source Port
it_it: Porta di origine

# WSLAddress
source: Detected WSL IP Address
fr_fr: Adresse IP WSL détectée
it_it: Indirizzo IP WSL rilevato

source: OK
fr_fr: D'accord
